# Тут временно будут находиться задания, прозьба проверяющему **не обращать внимания** тк в коде проэкта будет дублироваться текст поставленной задачи коментарием

Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1

Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

645 -> 5

78 -> третьей цифры нет

32679 -> 6

Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

6 -> да
7 -> да
1 -> нет

После загрузки задания, вы можете проверить себя самостоятельно с помощью эталонного решения

Доп задача
https://acmp.ru/asp/do/index.asp?main=task&id_course=1&id_section=5&id_topic=114&id_problem=699
Для нее нет эталоного решения можеть отправить на сайт и проверить её работоспособность
Это для того что бы ваша задача запустилась на платформе.
using System;

class Program {
static void Main(string[] args) {
Console.WriteLine("Hello, world!");
}
}